Documents/Renault_СписаниеНачислениеБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_СписаниеНачислениеБаллов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_ОстаткиБаллов</xr:Item>
				<xr:Item>AccumulationRegister.DMS_БонусныеБаллы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоБалловНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБалловСписано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогаситьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллыКСписанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллыКНачислению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Renault_КартыЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КартыЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMS_ВидКартыЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMS_ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMS_КартаЗамены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Renault_СписаниеНачислениеБаллов/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДанныеПоВозврату") Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ДанныеПоВозврату);		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
		
		ПараметрКонтрагент 		= Новый ПараметрВыбора("Отбор.Контрагент", 		ТекущийОбъект.Контрагент);
		ПараметрПометкаУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ПараметрКонтрагент);
		МассивПараметров.Добавить(ПараметрПометкаУдаления);
		
		НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
		
		Элементы.КартаЛояльности.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	ЗаполнитьДатуПогашения(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаЛояльностиПриИзменении(Элемент)
	КартаЛояльностиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КартаЛояльностиПриИзмененииНаСервере()
	
	Объект.Контрагент = Объект.КартаЛояльности.Контрагент;	
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.КартаЛояльности = ПолучитьКартуЛояльностиПоУмолчанию(Объект.Контрагент);
	Иначе 
		Объект.КартаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПараметрКонтрагент 		= Новый ПараметрВыбора("Отбор.Контрагент", Объект.Контрагент);
		ПараметрПометкаУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ПараметрКонтрагент);
		МассивПараметров.Добавить(ПараметрПометкаУдаления);
		НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
		
		Элементы.КартаЛояльности.ПараметрыВыбора = НовыеПараметры;
		
	Иначе 
		
		ПараметрПометкаУдаления = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(ПараметрПометкаУдаления);
		НовыеПараметры = Новый ФиксированныйМассив(МассивПараметров);
		
		Элементы.КартаЛояльности.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКартуЛояльностиПоУмолчанию(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КартыЛояльности.Ссылка КАК КартаЛояльности
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Контрагент = &Контрагент
		|	И НЕ КартыЛояльности.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КартаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		КартаЛояльности = ВыборкаДетальныеЗаписи.КартаЛояльности;
	КонецЕсли;
	
	Возврат КартаЛояльности;

КонецФункции // ПолучитьКартуЛояльностиПоУмолчанию()

&НаСервере
Процедура ЗаполнитьДатуПогашения(мОбъект)
	
	ВидКартыЛояльности  = мОбъект.КартаЛояльности.DMS_ВидКартыЛояльности;
	ПрограммаЛояльности = мОбъект.КартаЛояльности.ПрограммаЛояльности;
	
	Если ЗначениеЗаполнено(ВидКартыЛояльности)
		И ВидКартыЛояльности.ИспользоватьСрокДействияБаллов Тогда
		
		мОбъект.ПогаситьДо = ДобавитьКДате(мОбъект.Дата,Формат(ВидКартыЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ="),СокрЛП(ВидКартыЛояльности.ПериодичностьДействияБаллов)); 
		
	ИначеЕсли ЗначениеЗаполнено(ПрограммаЛояльности) 
		И ПрограммаЛояльности.СрокДействияБаллов <> 0 Тогда  
		
		мОбъект.ПогаситьДо = ДобавитьКДате(НачалоДня(мОбъект.Дата),Формат(ПрограммаЛояльности.СрокДействияБаллов,"ЧЦ=10; ЧН=0; ЧГ=")); 
	
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Функция ДобавитьКДате(мДата,Количество,Тип = "День")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДата", мДата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&мДата, "+Тип+", "+Количество+") КАК НоваяДата";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НоваяДата = мДата;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяДата = ВыборкаДетальныеЗаписи.НоваяДата;
	КонецЦикла;
	
	Возврат НоваяДата;
	
КонецФункции // ДобавитьКДате()
